nc: 13
scales: n
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, MELON, [256, 0.5]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, MELON, [512, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, FAMNet, [512, True, 2, 3]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, MELON, [1024, 0.5]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C4PMS, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, FAMNet, [512, False, 2, 3]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, FAMNet, [256, False, 2, 3]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, MELON, [512, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, MELON, [1024, 0.5]]
  - [[16, 19, 22], 1, CAHead, [nc]]
